{
  "summary": "Fix hero section layout shift by implementing fixed-width container for typing animation text. The issue occurs because the typing animation cycles through phrases of varying lengths ('Machine Learning Researcher' vs 'Engineering Lead'), causing the text container to change width dynamically and triggering layout reflow. The solution involves setting a fixed minimum width on the typing text container that accommodates the longest phrase across all responsive breakpoints.",
  "action_plan": [
    {
      "step": 1,
      "description": "Calculate the maximum width needed for the longest phrase ('Machine Learning Researcher') across all responsive breakpoints using the existing clamp() font-size values",
      "files": [
        "static/css/main.css"
      ]
    },
    {
      "step": 2,
      "description": "Add CSS rules to set fixed min-width on .typing-text container to prevent horizontal layout shifts during text changes",
      "files": [
        "static/css/main.css"
      ]
    },
    {
      "step": 3,
      "description": "Implement responsive min-width values for mobile (@media max-width: 768px) to account for different font sizes (clamp(2rem, 10vw, 3.5rem) vs clamp(2.5rem, 8vw, 5rem))",
      "files": [
        "static/css/main.css"
      ]
    },
    {
      "step": 4,
      "description": "Add text-align: left and overflow: hidden properties to ensure consistent text positioning and prevent any text overflow issues",
      "files": [
        "static/css/main.css"
      ]
    },
    {
      "step": 5,
      "description": "Test the fix by temporarily modifying the phrases array to include extreme length differences for validation, then revert",
      "files": [
        "static/js/main-static.js"
      ]
    },
    {
      "step": 6,
      "description": "Verify the existing min-height: 6rem on .hero-title is sufficient for vertical stability and adjust if needed",
      "files": [
        "static/css/main.css"
      ]
    }
  ],
  "estimated_effort": "Small",
  "risks": [
    "Fixed width might cause text truncation on very small screens if not calculated properly",
    "Different font rendering across browsers might affect the calculated width requirements",
    "The clamp() function creates dynamic font sizes that make precise width calculation challenging",
    "Mobile landscape orientation might have different width requirements than portrait",
    "Existing responsive design might be affected if width constraints are too rigid"
  ],
  "dependencies": [
    "CSS clamp() function support (already in use, modern browser requirement)",
    "Existing responsive breakpoint at 768px (already implemented)",
    "Current flexbox layout structure in .hero-content (no changes needed)",
    "Existing min-height: 6rem on .hero-title (already implemented)",
    "Font loading completion before width calculations (Inter font family already loaded)"
  ],
  "issue_number": 2,
  "issue_title": "Bug: Hero section moves up and down when typing animation changes text length"
}